Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetDocument
Returns the document associated with this event.
Since:
2023

Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetSelectedElements
Returns ElementIds of selected elements.
Since:
2023

Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetReferences
Returns the references that are currently selected.
Remarks:
The references can be an element or subelement in the host or a linked document.
Returns:
The collection containing the selected references.
Since:
2023

Autodesk.Revit.UI.Events.SelectionChangedEventArgs
The event arguments used by the SelectionChanged event.
Since:
2023